In [1]:
import pandas as pd
df = pd.read_csv("heights.csv")
df

      gender     height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[10000 rows x 2 columns]

In [2]:
df.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

In [3]:
df.tail()

      gender     height
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

In [4]:
df.describe()

             height
count  10000.000000
mean      66.367560
std        3.847528
min       54.263133
25%       63.505620
50%       66.318070
75%       69.174262
max       78.998742

# calculate the IQR

### IQR = Q3 - Q1

min<br>
Q1-> 25% Percentile<br>
Q2-> 50% Percentile<br>
Q3-> 75% Percentile<br>
max<br>

# To Remove outliers we have to come up with lower_limit and upper_limit

### lower_limit = Q1 - 1.5*IQR

### upper_limit = Q3 + 1.5*IQR

# Detect outliers using IQR

In [5]:
Q1 = df.height.quantile(0.25)
Q3 = df.height.quantile(0.75)
Q1, Q3

(np.float64(63.505620480000005), np.float64(69.17426172750001))

In [6]:
IQR = Q3 - Q1
IQR

np.float64(5.668641247500005)

In [7]:
lower_limit = Q1 - 1.5*IQR
upper_limit = Q3 + 1.5*IQR
lower_limit, upper_limit

(np.float64(55.00265860875), np.float64(77.67722359875002))

# Here are the outliers

In [8]:
df[(df.height<lower_limit)|(df.height>upper_limit)]

      gender     height
994     Male  78.095867
1317    Male  78.462053
2014    Male  78.998742
3285    Male  78.528210
3757    Male  78.621374
6624  Female  54.616858
7294  Female  54.873728
9285  Female  54.263133

# Remove outliers

In [9]:
df_no_outlier = df[(df.height>lower_limit)&(df.height<upper_limit)]
df_no_outlier

      gender     height
0       Male  73.847017
1       Male  68.781904
2       Male  74.110105
3       Male  71.730978
4       Male  69.881796
...      ...        ...
9995  Female  66.172652
9996  Female  67.067155
9997  Female  63.867992
9998  Female  69.034243
9999  Female  61.944246

[9992 rows x 2 columns]